Repository: timokilale/sepesha
Catalog: lib/l10n/app_*.arb
Languages: sw

source: Home
sw: Nyumbani

source: Trips
sw: Safari

source: Account
sw: Akaunti

source: Settings
sw: Mipangilio

source: Language
sw: Lugha

source: English
sw: Kiingereza

source: Swahili
sw: Kiswahili

source: Personal Information
sw: Maelezo ya Kibinafsi

# manageProfileDetails
source: Manage your profile details
sw: Dhibiti maelezo ya wasifu wako

source: Payment Methods
sw: Njia za Malipo

# managePaymentOptions
source: Manage your payment options
sw: Dhibiti chaguo za malipo yako

source: Messages
sw: Ujumbe

# viewConversations
source: View your conversations
sw: Ona mazungumzo yako

# appPreferencesSettings
source: App preferences and settings
sw: Mapendeleo ya programu na mipangilio

source: Help & Support
sw: Msaada na Uongozi

# getHelpSupport
source: Get help and support
sw: Pata msaada na uongozi

source: About
sw: Kuhusu

# appInformationVersion
source: App information and version
sw: Maelezo ya programu na toleo

source: Logout
sw: Toka

# signOutAccount
source: Sign out of your account
sw: Toka kwenye akaunti yako

source: Profile
sw: Wasifu

source: Edit
sw: Hariri

source: Cancel
sw: Ghairi

source: Save
sw: Hifadhi

source: Total Rides
sw: Jumla ya Safari

source: Rating
sw: Kiwango

# logoutConfirmation
source: Are you sure you want to logout from your account?
sw: Je, una uhakika unataka kutoka kwenye akaunti yako?

source: Yes
sw: Ndiyo

source: No
sw: Hapana

source: Language Settings
sw: Badili lugha

source: Select Language
sw: Chagua Lugha

# languageChanged
source: Language changed successfully
sw: Lugha imebadilishwa kwa mafanikio

source: Notifications
sw: Arifa

# notificationsComingSoon
source: Notifications feature coming soon!
sw: Kipengele cha arifa kinakuja hivi karibuni!

# filterTrips
source: Filter trips feature coming soon!
sw: Chuja safari!

source: USER
sw: Mtumiaji

source: CUSTOMER
sw: Mteja

source: DRIVER
sw: Dereva

source: VENDOR
sw: MUUZAJI

source: Main
sw: Kuu

source: Support
sw: Msaada

source: App information
sw: Taarifa kuhusu Sepesha

source: History
sw: Historia

source: Wallet
sw: Mfukoni

# manageWallet
source: Manage your wallet
sw: Dhibiti mfuko wako

source: Your driver has arrived
sw: Dereva wako amefika

source: is waiting
sw: anasubiri

source: Contact Us
sw: Wasiliana Nasi

source: WhatsApp Chat
sw: Chat kwa WhatsApp

source: Quick response via WhatsApp
sw: Majibu haraka kwa WhatsApp

source: Phone Call
sw: Simu

source: Speak directly with our team
sw: Zungumza moja kwa moja na timu yetu

source: Version
sw: Toleo

source: Key Features
sw: Vipengele Muhimu

source: Contact Information
sw: Maelezo ya Mawasiliano

source: All rights reserved
sw: Haki zote zimehifadhiwa

source: Save time, save money and
sw: Okoa muda, okolea pesa na

source: Safe ride
sw: Safari salama

# useYourSmartphoneToOrder
source: Use your smartphone to order a ride, get picked up by a nearby driver, and enjoy a low-cost trip to your destination.
sw: Tumia simu yako ya mkononi kuagiza safari, kuchukuliwa na dereva aliyeko karibu, na kufurahia safari ya gharama ya chini hadi mahali unapokwenda.

source: Get connected with
sw: Jiunge na

source: nearby drivers
sw: dereva wa karibu

# quicklyMatchWithReliable
source: Quickly match with reliable drivers around you for faster pickups and better service.
sw: Pata dereva wa kujiamini karibu nawe kwa haraka kwa kuchukua haraka zaidi na huduma bora zaidi.

source: Enjoy a ride with
sw: Furahia safari na

source: full comfort
sw: rahisi kabisa

# relaxInWellMaintained
source: Relax in well-maintained vehicles while your driver takes care of the road.
sw: Pumzika katika magari yazuri yaliyohifadhiwa wakati dereva wako akiendesha barabarani.

source: Rides completed
sw: Safari zilizofanikiwa

# vehicleInfo
source: Vehicle Information
sw: Taarifa za gari

source: Vehicle Type
sw: Aina ya gari

source: Vehicle Number
sw: Nambari ya gari

source: License Number
sw: Nambari ya leseni

source: Location Access Required
sw: Ruhusa ya kupata mahali ulipo inahitajika

# enableLocationPermissions
source: Tap to enable location permissions to go online
sw: Gonga ili kuwezesha ruhusa za mahali ulipo ili uweze kuingia mtandaoni

source: You are Online
sw: Uko mtandaoni

source: You are Offline
sw: Hauko mtandaoni, washa intaneti

source: Waiting for ride requests...
sw: Inasubiri ombi la safari...

source: Pickup:
sw: Eneo la kukusanya mzigo

source: Destination:
sw: Mahali pa Kwenda

source: Start Ride
sw: Anza safari

source: New Ride Request
sw: Tafuta safari mpya

source: From:
sw: Kutoka:

source: To:
sw: Kwenda:

source: Decline
sw: Kataa

source: Accept
sw: Kubali

source: Pickup Location
sw: Eneo la kukusanya mzigo

source: Dropoff Location
sw: Eneo la kupeleka mzigo

source: Refresh Location
sw: Sahihisha mahali ulipo

source: Location updated:
sw: Mahali ulipo pamebadilishwa:

# couldNotGetLocation
source: Could not get current location. Check permissions.
sw: Haikuwezekana kupata mahali ulipo kwaa sasa. Angalia ruhusa kwenye settings.

# areYouSureLogout
source: Are you sure you want to logout from your account?
sw: Una uhakika unataka kutoka?

source: Location Services Disabled
sw: Huduma za mahali ulipo zimezimwa

# enableLocationServices
source: Location services are turned off. Please enable location services in your device settings to use this feature.
sw: Huduma za mahali ulipo zimezimwa. Tafadhali weka huduma za mahali ulipo katika settings za simu yako ili kuendelea.

source: Open Settings
sw: Fungua settings

source: Location Permission Required
sw: Ruhusa ya mahali ulipo inahitajika

# enableLocationPermission
source: Location permission is required to go online as a driver. Please enable location permission in app settings.
sw: Ruhusa ya mahali ulipo inahitajika ili uweze kuingia mtandaoni kama dereva. Tafadhali weka ruhusa ya mahali ulipo katika settings za simu.

source: Location Permission Denied
sw: Ruhusa ya mahali ulipo imekataliwa

# grantLocationPermission
source: Location permission is required to track your position as a driver. Please grant location permission to continue.
sw: Ruhusa ya mahali ulipo inahitajika kutambua nafasi yako kama dereva. Tafadhali toa ruhusa ya mahali ulipo ili kuendelea.

source: Try Again
sw: Jaribu Tena

# locationPermissionsEnabled
source: Location permissions are already enabled! You can go online.
sw: Ruhusa za mahali ulipo zimewasha! Unaweza kuingia mtandaoni.

# unableToGetLocationPermissions
source: Unable to get location permissions. Please check your device settings.
sw: Haikuwezekana kupata ruhusa za mahali ulipo. Tafadhali angalia settings za simu.

# locationPermissionsGranted
source: Location permissions granted! Getting your location...
sw: Ruhusa za mahali ulipo zimetolewa! Inaelekea eneo lako...

# locationFound
source: Location found! Map updated to your current position.
sw: Mahali ulipo pamepatikana! Ramani imesahihishwa kwa nafasi yako ya sasa.

source: Error requesting location permission:
sw: Imeshindikana kupata mahali ulipo

source: Distance
sw: Umbali

source: Driver Name
sw: Jina la dereva

source: Payment Method
sw: Njia ya malipo

source: Cancel ride
sw: Ghairi safari

source: Retry
sw: Jaribu Tena

source: No active rides
sw: Hakuna safari inayoendelea

source: No completed rides
sw: Hakuna safari zilizokwisha

source: No canceled rides
sw: Hakuna safari zilizobatilishwa

source: Unknown Driver
sw: Dereva asiyejulikana

source: COST
sw: GHARAMA

source: DATE
sw: TAREHE

source: Estimated trip time:
sw: Muda wa safari unaotarajiwa

source: Contact Driver
sw: Wasiliana na dereva

source: Book Again
sw: Agiza tena

source: Trip duration:
sw: Muda wa safari:

source: Rate This Ride
sw: Toa wastani wa safari Hii

source: Choose Your Ride
sw: Chagua safari Yako

source: Back to home
sw: Rudi nyumbani

# twoWheeler
source: 2 Wheeler
sw: Usafiri wa magurudumu mawili

# fourWheeler
source: 4 Wheeler
sw: Usafiri wa magurudumu manne

source: Add Luggage Space
sw: Ongeza nafasi ya mizigo

source: Have a promo code?
sw: Una code ya punguzo?

source: Enter promo code
sw: Ingiza code ya punguzo

source: Apply
sw: Tumia

# continueButton
source: Continue
sw: Endelea

source: Capacity:
sw: Uwezo:

# lookingForDriver
source: Looking for a driver
sw: Dereva anatafutwa

# findingBestDriver
source: We're finding the best driver for you
sw: Tunatafuta dereva bora kwa ajili yako

source: Trip in progress
sw: Safari inayoendelea

source: Time
sw: Muda

source: Price
sw: Bei

source: End Trip
sw: Maliza safari

source: Complete Trip
sw: Maliza safari

# areYouSureEndTrip
source: Are you sure you want to end this trip?
sw: Je! Una hakika unataka kumaliza safari hii?

source: Complete
sw: Maliza

source: Edit Profile
sw: Badilisha taarifa za wasifu

source: Profile Picture
sw: Picha ya Wasifu

source: First Name
sw: Jina la kwanza

# firstNameRequired
source: First name is required
sw: Jina la kwanza linahitajika

# middleName
source: Middle Name (Optional)
sw: Jina la kati (Hiari)

source: Last Name
sw: Jina la mwisho

# lastNameRequired
source: Last name is required
sw: Jina la mwisho linahitajika

source: Email Address
sw: Anwani ya barua pepe

# emailRequired
source: Email is required
sw: Barua pepe inahitajika

source: Invalid email format
sw: Barua pepe hii si sahihi

source: Phone Number
sw: Nambari ya simu

# phoneNumberRequired
source: Phone number is required
sw: Nambari ya simu inahitajika

# phoneNumberMinDigits
source: Phone number must be at least 9 digits
sw: Nambari ya simu inapaswa kuwa na nambari 9 au zaidi

source: Region
sw: Mkoa

source: Select Region
sw: Chagua mkoa

source: Save Changes
sw: Hifadhi mabadiliko

source: Error saving profile:
sw: Hitilafu imetokea wakati wa kukusanya wasifu:

source: Reviews
sw: Maoni

source: Failed to load reviews
sw: Imeshindikana kupata maoni

source: No reviews available
sw: Hakuna maoni yoyote

source: Based on customer feedback
sw: Kulingana na maoni ya wateja

source: Anonymous
sw: Hajulikani

source: days ago
sw: idadi ya siku zilizopita

source: hours ago
sw: idadi ya masaa yaliyopita

source: Recently
sw: Hivi karibuni

# findingDriver
source: Finding a driver...
sw: Dereva anatafutwa...

source: Reject
sw: Kataa

source: Minutes to delivery
sw: Dakika za kupeleka

source: Call Recipient
sw: Piga simu kwa mpokeaji

source: Start Drop off process
sw: Anza mchakato wa kufikisha mzigo

source: Delivery Completed!
sw: Safari imekamilika!

# pleaseRateDriver
source: Please rate your driver...
sw: Tafadhali kadiri dereva wako...

# cannotRateDriver
source: Cannot rate: Driver information not available
sw: Imeshindikana kutoa wastani: Taarifa za dereva hazipatikani

source: Delivery in progress
sw: Safari inayoendelea

source: Driver Stats
sw: Takwimu za dereva

source: Select Luggage Size
sw: Chagua ukubwa wa Mizigo

source: Personal Item
sw: Mzigo binafsi

source: International carry on
sw: Kubeba kimataifa

source: Domestic Carry On
sw: Kubeba ndani ya nchi

source: Small Checked
sw: Tumia mfuko mdogo

source: Medium Checked
sw: Tumia mfuko wa kati

source: Take proof of Pickup Parcel
sw: Chukua ushahidi wa mzigo iliyochukuliwa

source: Request a Ride
sw: Agiza usafiri

source: Ride Amount:
sw: Gharama ya safari:

source: Additional Cost:
sw: Gharama za ziada:

source: Total:
sw: Jumla:

# yourTravelTakes
source: Your travel takes minutes
sw: Safari yako inachukua dakika 13.

# findingNearestRide
source: Finding the nearest Ride...
sw: Kutafuta safari karibu...

source: Rideway
sw: Njia

# affordableRides
source: Affordable rides, all to yourself
sw: Safari za bei nafuu, yote kwa ajili yako

source: Rideway SUV
sw: Njia ya SUV

source: Luxury rides
sw: Safari za kishua

source: Next
sw: ENDELEA

source: Luggage
sw: Mizigo

source: Discount code
sw: Code ya kupunguza bei

source: Enter Discount Code
sw: Weka code ya kupunguza bei

source: Enter code
sw: Weka code

source: typing...
sw: anaandika...

source: Online
sw: Yupo mtandaoni

source: Block
sw: Zuia

source: Copy
sw: Nakili

source: Reply
sw: Jibu

source: Delete
sw: Futa

source: Delete Conversation
sw: Futa Mazungumzo

# areYouSureDeleteConversation
source: Are you sure you want to delete this conversation with
sw: Una uhakika unataka kufuta mazungumzo haya na

source: Skip
sw: Ruka

source: Submitting...
sw: Inatuma...

source: Submit Rating
sw: Tuma Kadiri

source: Poor
sw: Mbaya

# helloWelcomeBack
source: Hello, {userType}! Welcome back
sw: Hujambo! Karibu tena

# enterPhoneVerification
source: Enter your phone number We'll send you a verification code
sw: Ingiza nambari ya simu yako tutakutumia OTP code ya uhakiki

source: Confirm Location
sw: Thibitisha Mahali

source: Quick Stats
sw: Takwimu za Haraka

source: Search conversations...
sw: Tafuta mazungumzo...

source: No results found
sw: Hakuna matokeo yaliyopatikana

source: Try searching with different keywords
sw: Jaribu kutafuta kwa maneno tofauti

source: Clear Search
sw: Futa utafutaji

source: No conversations yet
sw: Hakuna mazungumzo bado

# startNewConversationToBeginMessaging
source: Start a new conversation to begin messaging
sw: Anza mazungumzo mapya kuanza kutuma ujumbe

source: Start New Chat
sw: Anza mazungumzo mapya

source: Something went wrong
sw: Kuna kitu kimekosea

source: Mark all as read
sw: Weka yote kama yamekwisha somwa

source: New Conversation
sw: Mazungumzo mapya

source: Search contacts...
sw: Tafuta anwani...

source: Conversation deleted
sw: Mazungumzo yamefutwa

source: Undo
sw: Tendua

source: All conversations marked as read
sw: Mazungumzo yote yamewekwa kama yamekwisha somwa

source: Message settings coming soon
sw: Mipangilio ya ujumbe itakuja hivi karibuni

source: Set Pickup Location
sw: Weka mahali pa kukusanya mzigo

source: Set Destination
sw: Weka mahali pa kwenda mzigo

# startTypingToSearch
source: Start typing to search for locations
sw: Anza kuandika kutafuta maeneo

source: Type at least 2 characters
sw: Andika angalau herufi 2

source: No locations found
sw: Hakuna maeneo yaliyopatikana

source: Driver Found
sw: Dereva Amepatikana

source: Payment
sw: Malipo

source: Search country...
sw: Tafuta nchi...

# driverDescription
source: Login as a driver for easy gain request from customers and vendors
sw: Ingia kama dereva kwa ajili ya kupata ombi la haraka kutoka kwa wateja na wachuuzi

source: Vendor/Business
sw: Mfanyabiashara

# vendorDescription
source: Login as a vendor to manage your products and receive orders
sw: Ingia kama mchuuzi kudhibiti bidhaa zako na kupokea maagizo

# customerDescription
source: Login as a customer to request deliveries and order products
sw: Ingia kama mteja kuomba utoaji na kuagiza bidhaa

source: Login as Driver or Vendor
sw: Ingia kama dereva au mfanyabiashara

source: Login as Customer or Vendor
sw: Ingia kama mteja au mfanyabiashara

source: Login as Customer or Driver
sw: Ingia kama mteja au dereva

source: Login
sw: Ingia

source: Not registered?
sw: Hujasajiliwa?

source: Sign Up
sw: Jisajili

# byContinuingYouAgree
source: By continuing, you agree to our
sw: Kwa kuendelea, unakubali

source: Terms & Conditions
sw: Masharti

source: and
sw: na

source: Privacy Policy
sw: Sera ya faragha

source: . You're over 18.
sw: . Una umri wa miaka 18 au zaidi.

source: GET STARTED
sw: ANZA

source: Fair
sw: Wastani

source: Good
sw: Nzuri

source: Very Good
sw: Nzuri Sana

source: Excellent
sw: Bora Kabisa

source: Rate your experience
sw: Kadiri uzoefu wako

source: Error signing out
sw: Imeshindikana kutoka

source: Find Ride
sw: Pata safari

source: Account Statistics
sw: Takwimu za akaunti

source: Average Rating
sw: Kadiri ya wastani

source: Wallet (TZS)
sw: Mkoba (TZS)

source: Wallet (USD)
sw: Mkoba (USD)

source: Preferred Payment Method
sw: Njia ya malipo iliyochaguliwa

source: Verified Account
sw: Akaunti imehakikiwa

source: Pending Verification
sw: Inasubiri uhakiki

source: Search Ride
sw: Tafuta safari

source: Where are you going?
sw: Unaenda wapi?

source: Enter location
sw: Ingiza mahali ulipo

# driverEmail
source: driver@sepesha.com
sw: dereva@sepesha.com

# notAvailable
source: N/A
sw: Hazipatikani

source: Driver Profile
sw: Wasifu wa dereva

# manageDriverProfile
source: Manage your driver profile
sw: Dhibiti wasifu wa dereva

# viewWalletBalance
source: View wallet balance and transactions
sw: Angalia salio la mkoba na miamala

source: Wallet Balance
sw: Salio la mkoba

source: Plate Number
sw: Nambari ya bango

source: Payment Preference
sw: Upendeleo wa malipo

source: Ride History
sw: Historia ya safari

source: Active
sw: Inatumika

source: Completed
sw: Imekamilika

source: Canceled
sw: Imeghairiwa

source: Calculating...
sw: Inahesabu...

source: Unknown
sw: Haijulikani

source: Driver not assigned
sw: Dereva hajachaguliwa

source: Location unavailable
sw: Mahali hapapatikani

source: Calculating arrival...
sw: Inahesabu muda wa kufika...

source: Arriving now
sw: Anafika sasa

# arrivesInMinute
source: Arrives in 1 minute
sw: Atafika dakika 1

source: Arrives in minutes
sw: Atafika dakika

source: About Sepesha
sw: Kuhusu Sepesha

source: Our Mission
sw: Dhamira yetu

# supportEmail
source: Email: support@sepesha.com
sw: Barua pepe: support@sepesha.com

# supportPhone
source: Phone: +255 123 456 789
sw: Simu: +255 123 456 789

# website
source: Website: www.sepesha.com
sw: Tovuti: www.sepesha.com

# address
source: Address: Lorem ipsum street, 123 Dar es Salaam, Tanzania
sw: Anwani: Lorem ipsum street, 123 Dar es Salaam, Tanzania

source: Legal
sw: Kisheria

source: Terms of Service
sw: Masharti ya huduma

source: End User License Agreement
sw: Makubaliano ya leseni ya mtumiaji wa mwisho

# copyright
source: Â© 2024 Sepesha. All rights reserved.
sw: Â© 2024 Sepesha. Haki zote zimehifadhiwa.

source: Failed to load messages
sw: Imeshindikana kupakia ujumbe

source: No messages yet
sw: Hakuna ujumbe bado

# startConversation
source: Start the conversation by sending a message
sw: Anza mazungumzo kwa kutuma ujumbe

source: Last seen recently
sw: Alionekana hivi karibuni

source: View Profile
sw: Angalia wasifu

source: Clear Chat
sw: Futa mazungumzo

source: Block User
sw: Zuia mtumiaji

# areYouSureClearChat
source: Are you sure you want to clear this chat? This action cannot be undone.
sw: Una uhakika unataka kufuta mazungumzo haya? Kitendo hiki hakiwezi kubadilishwa.

# areYouSureBlockUser
source: Are you sure you want to block this user?
sw: Una uhakika unataka kumzuia mtumiaji huyu?

# messageCopied
source: Message copied to clipboard
sw: Ujumbe umenakiliwa kwenye clipboard

source: Message deleted
sw: Ujumbe umefutwa

source: Reply functionality coming soon
sw: Kipengele cha kujibu kinakuja hivi karibuni

source: Voice call feature coming soon
sw: Kipengele cha simu ya sauti kinakuja hivi karibuni

source: Video call feature coming soon
sw: Kipengele cha simu ya video kinakuja hivi karibuni

source: Profile view coming soon
sw: Mhakiki wa wasifu unakuja hivi karibuni

source: Chat cleared
sw: Mazungumzo yamefutwa

source: User blocked
sw: Mtumiaji amezuiwa

source: Save image coming soon
sw: Uhifadhi wa picha unakuja hivi karibuni

source: Failed to load image
sw: Imeshindikana kupakia picha

source: Failed to share location:
sw: Imeshindikana kushiriki mahali:

source: User Type
sw: Aina ya mtumiaji

source: Account Status
sw: Hali ya akaunti

source: Verified
sw: Imehakikiwa

source: Unverified
sw: Haijahakikiwa

source: Wallet Balance (TZS)
sw: Salio la mkoba (TZS)

source: Wallet Balance (USD)
sw: Salio la mkoba (USD)

source: Account Information
sw: Maelezo ya akaunti

source: Success
sw: Mafanikio

source: Profile updated successfully
sw: Wasifu umesasishwa kwa mafanikio

source: Error
sw: Hitilafu

source: Failed to update profile
sw: Imeshindikana kusasisha wasifu

source: No profile data available
sw: Hakuna data ya wasifu inayopatikana

source: Current Location
sw: Mahali ulipo sasa

source: Loading payment methods...
sw: Inapakia njia za malipo...

source: Payment method updated
sw: Njia ya malipo imesasishwa

source: Failed to update payment method
sw: Imeshindikana kusasisha njia ya malipo

source: Wallet Balance Details
sw: Maelezo ya salio la mkoba

source: TZS Balance
sw: Salio la TZS

source: USD Balance
sw: Salio la USD

# walletReadyForPayments
source: Your wallet is ready for payments
sw: Mkoba wako uko tayari kwa malipo

# addFundsToWallet
source: Add funds to your wallet to use this payment method
sw: Ongeza fedha kwenye mkoba wako kutumia njia hii ya malipo

source: Unable to load wallet balance
sw: Haiwezekani kupakia salio la mkoba

source: Close
sw: Funga

source: Refresh
sw: Onyesha upya

source: Done
sw: Imekamilika

source: Selected
sw: Imechaguliwa
